{
  "backend/main.mo": "Motoko canister implementing user profile storage and admin-restricted product CRUD with authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of all major frontend files.",
  "frontend/index.css": "Base Tailwind stylesheet defining custom design system variables for light and dark themes.",
  "frontend/index.html": "Root HTML document bootstrapping the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Application entry component configuring TanStack Router routes and wrapping the app with theme and toast providers.",
  "frontend/src/components/AppLayout.tsx": "Layout component providing shared navigation, main content area, and footer across pages.",
  "frontend/src/components/Footer.tsx": "Footer component showing branding, dynamic year, and a caffeine.ai attribution link.",
  "frontend/src/components/NavBar.tsx": "Navigation bar handling authentication, admin link visibility, user profile display, and profile setup prompts.",
  "frontend/src/components/products/ProductForm.tsx": "React form component for creating or editing products with validation and submit handling.",
  "frontend/src/components/products/ProductList.tsx": "Displays a table of products with loading/empty states and an edit action.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for first-time users to enter and save their profile name with validation and feedback.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor, refreshing it on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useAdminStatus.ts": "Checks whether the current authenticated user is an admin using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout methods, and loads persisted identities.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profiles and product CRUD operations via the actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point initializing React, query client, and identity provider.",
  "frontend/src/pages/AccessDenied.tsx": "UI page shown when a user lacks required permissions, with explanation and navigation back home.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that checks admin status, lists products, and provides forms to create or edit products with navigation and toast feedback.",
  "frontend/src/pages/Home.tsx": "Landing page showing feature cards and navigation options based on authentication and admin status.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, animations, and content paths.",
  "project_state.json": "Project metadata describing features, pending requests, known issues, and current state of the Ocarina Store Admin app."
}